#+title: Still tracing the same error: Method for make-parameter
#+date: <2023-02-09 10:58>
#+description:
#+filetags: gerbil scheme gambit javascript repl debug


#+begin_src bash :session gxm-param
  GXJS_SRC=$(cd .. && pwd)
  GERBIL_GSC=$GXJS_SRC/bin/gsc
#+end_src

#+begin_src scheme

  (declare (block) (standard-bindings) (extended-bindings)
           (debug) (debug-location) (debug-source) (debug-environments)
           )
#+end_src


* UPDATE: WTF!

Don't even ask how I tracked this down, but here's what happens.

#+begin_src bash :results verbatim :wrap example
  gxi-boot () {
      ../bin/gxi-boot "$@"
  }

  gxi-boot -e '(displayln "\n----- Gerbil is working -----")'\
           -e '(import :gerbil/compiler/base)' \
           -e '(displayln "See?: " gxc#current-compile-symbol-table)' \
           -e '(displayln "But, now ...")' \
           -e '(import :gerbil/compiler/compile)' \
           -e '(displayln "Shut us ill fackud ep")'
#+end_src

#+RESULTS:
#+begin_example
/home/drewc/me/MuKn/src/gerbil.js/log

----- Gerbil is working -----
See?: #<procedure #2 gxc#current-compile-symbol-table>
But, now ...
Core Context Was: #<expression-form #3> With method #<procedure #4 gx#core-expander::compile-top-syntax>
Loaded comp1
Now looking for the method: test#<top-special-form #5>%#begin-annotation#f

Wait, does this look for the method of whatever was output on stdout while this file is loading?
,*** ERROR IN _gx#compile-top -- Cannot find method #<top-special-form #6> make-parameter
>
,*** EOF again to exit
#+end_example

#+begin_example
/home/drewc/me/MuKn/src/gerbil.js/log

----- Gerbil is working -----
See?: #<procedure #2 gxc#current-compile-symbol-table>
But, now ...
Core Context Was: #<expression-form #3> With method #<procedure #4 gx#core-expander::compile-top-syntax>
Loaded comp1
,*** ERROR IN _gx#compile-top -- Cannot find method #<top-special-form #5> make-parameter
>
,*** EOF again to exit
#+end_example

#+begin_example
/home/drewc/me/MuKn/src/gerbil.js/log

----- Gerbil is working -----
See?: #<procedure #2 gxc#current-compile-symbol-table>
But, now ...
Core Context Was: #<expression-form #3> With method #<procedure #4 gx#core-expander::compile-top-syntax>
Loaded comp1
Now looking for the method:
#<top-special-form #5>make-parameter#f

Wait, does this look for the method of whatever was output on stdout while this file is loading?
,*** ERROR IN _gx#compile-top -- Cannot find method #<top-special-form #6> "Now looking for the method: "
>
,*** EOF again to exit
#+end_example



* Kompiler time: clone dat


#+begin_src bash :results verbatim :wrap example
  gxi-boot () {
      ../bin/gxi-boot "$@"
  }

  gxi-boot -e '(displayln "\n----- Gerbil is working -----")'\
           -e '(import :gerbil/compiler/base)' \
           -e '(displayln "See?: " gxc#current-compile-symbol-table)' \
           -e '(load-module "gerbil/kompiler/foo")' \
           -e '(foo "bar\n")' \
           -e '(load-module "gerbil/kompiler/kompile__0")' \
           -e '(displayln (something-to-export #t))' \
           -e '(load-module "gerbil/kompiler/kompile__1")' \
           -e '(displayln "But, now ...")' \
           -e '(load-module "gerbil/kompiler/compile")' \
           -e '(load-module "gerbil/expander/compile__0")' \
           -e '(load-module "gerbil/foo/compiler__0")' \
           -e '(load-module "gerbil/foo/compile")' \
           -e '(displayln "OMFG IS IT JUST THE NAME OF THE MODULE? ")' \
           -e '(load-module "gerbil/foo/compile__0")' \
           -e '(displayln " ... and, now ...")' \
           -e '(load-module "gerbil/kompiler/compile__0")' \
           -e '(displayln "Shut us ill fackud ep")'
#+end_src

#+RESULTS:
#+begin_example
/home/drewc/me/MuKn/src/gerbil.js/log

----- Gerbil is working -----
See?: #<procedure #2 gxc#current-compile-symbol-table>
bar
,*** entering bb1_kompile____0_23_
,*** entering bb1_something_2d_to_2d_export
,*** entering bb2_something_2d_to_2d_export
42
,*** entering bb1_kompile____1_23_
But, now ...
,*** entering bb1_compile_23_
OMFG IS IT JUST THE NAME OF THE MODULE?
,*** entering bb1_compile____0_23_
,*** ERROR IN _gx#compile-top -- Cannot find method #<top-special-form #3> This-is-the-first-form-in-a-buffer/module-named-compile__0
>
,*** EOF again to exit
#+end_example

#+begin_src bash :results verbatim :wrap example
  gxi-boot () {
      ../bin/gxi-boot "$@"
  }

  gxi-boot -e '(displayln "\n----- Gerbil is working -----")'\
           -e '(displayln "OMFG IS IT JUST THE NAME OF THE MODULE? ")' \
           -e '(load-module "gerbil/foo/compile__0")' \
           -e '(displayln " ... and, now ...")' \
           -e '(displayln "Shut us ill fackud ep")'
#+end_src

#+RESULTS:
#+begin_example
/home/drewc/me/MuKn/src/gerbil.js/log

----- Gerbil is working -----
OMFG IS IT JUST THE NAME OF THE MODULE?
,*** entering bb1_compile____0_23_
,*** ERROR IN _gx#compile-top -- Cannot find method #<top-special-form #2> This-is-the-first-and-only-form-in-a-buffer/module-named-compile__0
>
,*** EOF again to exit
#+end_example

It turns out it was all about bytecode.

